import { Component } from '@angular/core';
import { NavController } from '@ionic/angular';
import { DetailPage } from '../detail/detail.page';

@Component({
  selector: 'app-tab1',
  templateUrl: 'tab1.page.html',
  styleUrls: ['tab1.page.scss']
})
export class Tab1Page {
  products: any;
  displayProducts = [];

  constructor(private navCtrl: NavController) {
    this.products = [
      {
        ProductName: 'อเมริกัน ช็อตแฮร์ (American Short Hair)',
        pic: './assets/icon/American.jpg',
        docDetail: 'อเมริกัน ช็อตแฮร์เป็นสายพันธุ์แมวที่ฮอตฮิตมาก เพราะมีลวดลายที่สวยงามแปลกตา เป็นแมวที่มีหน้าตาน่ารัก และรูปร่างก็น่าฟัดน่ากอด ค่อนข้างเลี้ยงง่าย เพราะน้องสามารถเล่นได้ด้วยตัวเอง จึงไม่ค่อยอ้อนคนมากนัก เหมาะกับทาสที่ชอบเอาชนะใจแมวหรืออยากให้แมวมาสนใจอย่างยิ่ง เนื่องจากน้องมีโลกส่วนตัวค่อนข้างสูง'
      },
      {
        ProductName: 'บริติช ช็อตแฮร์ (British Shorthair)',
        pic: './assets/icon/British.jpg',
        docDetail: 'บริติช ช็อตแฮร์เป็นสายพันธุ์แมวที่ค่อนข้างเงียบ ไม่ค่อยส่งเสียงร้อง สามารถเลี้ยงในคอนโดได้ แต่ที่อยากนำเสนอเป็นพิเศษคือน้องเป็นพันธุ์แมวที่น่ารักและขี้อ้อนมาก ๆ แถมใบหน้ายังกลมใหญ่ดูเป็นไอ้ต้าวอ้วน แต่จริง ๆ แล้วสายพันธุ์ของน้องเป็นสายพันธุ์แมวที่แข็งแรง มีกล้ามเนื้อเยอะเฉย ๆ โดยส่วนใหญ่สีที่คนนิยมเลี้ยงจะเป็นสีเทาหรือสีสวาด แต่คนในวงการแมวจะเรียกว่าสีบลู'
      },
      {
        ProductName: 'สก็อตติช โฟลด์ (Scottish Fold)',
        pic: './assets/icon/Scottish.jpg',
        docDetail: 'หากพูดถึงสายพันธุ์แมวที่เป็นขวัญใจของสาว ๆ ต้องยกให้สก็อตติช โฟลด์เขาเลยล่ะ เรียกได้ว่าเป็นแมวที่น่าทะนุถนอมสุด ๆ เพราะขนาดของนางนั้นมินิเหลือเกิน แถมหน้าตายังบ้องแบ๊วชวนหลงใหล และยังชอบวิ่งสุด ๆ แต่บทจะเงียบก็เงียบจริง ๆ และบอกไว้ก่อนว่าน้องจะอ้อนแค่ตอนหิวเท่านั้น'
      },
      {
        ProductName: 'มันช์กิ้น (Munchkin)',
        pic: './assets/icon/Munchkin.jpg',
        docDetail: 'นี่ก็เป็นอีกหนึ่งสายพันธุ์แมวที่น่ารักไม่เบา ใคร ๆ มักเรียกน้องว่า “เจ้าเตี้ย” เพราะน้องขาสั้นถึงขั้นพุงติดพื้นเลยทีเดียว แต่เห็นแบบนี้จังหวะยืนสองขาก็ทำเอาเหล่าทาสใจละลายเหมือนกัน และยังขี้อ้อนสุด ๆ เดินไปไหนก็ตามตลอด แถมยังซนเอามาก ๆ'
      },
      {
        ProductName: 'เบงกอล (Bengal)',
        pic: './assets/icon/Bengal.jpg',
        docDetail: 'ใครที่หลงใหลในความน่ารักของลูกเสือ ต้องมีเจ้าเบงกอลไปเลี้ยงสักตัวแล้วล่ะ เพราะลวดลายของน้องนั้นเหมือนเสือจากัวร์มาก เนื่องจากเป็นแมวที่ผสมข้ามสายพันธุ์ระหว่างแมวดาวกับแมวบ้าน แต่ถ้าใครกังวลเรื่องความดุร้ายนั้นไม่ต้องห่วง เพราะน้องเชื่องและเป็นมิตรกับคนมาก ๆ แถมยังฉลาด คล่องแคล่วปราดเปรียว วิ่งเก่ง พลังนี่ล้นเหลือ และยังชอบเล่นน้ำเป็นที่สุด คงจะเป็นสัญชาตญาณของแมวดาวแน่ ๆ'
      },
      {
        ProductName: 'อเมริกัน เคิร์ล (American Curl)',
        pic: './assets/icon/Curl.jpg',
        docDetail: 'อเมริกัน เคิร์ล เป็นสายพันธุ์แมวที่มีลักษณะโดดเด่นให้เห็นชัด นั่นก็คือหูจะพับไปด้านหลัง มีความเป็นแมวผู้ดี ทรวดทรงองเอวสวยงาม ชอบเล่นกับคน มีความขี้อ้อน ชอบอยู่ข้าง ๆ มนุษย์ แต่ไม่ชอบให้อุ้ม แถมยังชอบปีนป่ายและกระโดดไปมาอีกด้วย'
      },
      {
        ProductName: ' เอ็กโซติก ช็อตแฮร์ (Exotic Shorthair)',
        pic: './assets/icon/Exotic.jpg',
        docDetail: 'เอ็กโซติก ช็อตแฮร์ เป็นสายพันธุ์แมวที่ค่อนข้างเป็นมิตรกับทุกคน ชอบคลอเคลีย และยังได้รับฉายาว่าเป็นแมวหน้ามึนอีกด้วย แถมตัวอ้วนกลมน่ากอดมาก ๆ ช่างสงสัยเป็นที่หนึ่งเลยล่ะ ใครที่คิดจะเลี้ยงแมวพันธุ์นี้อาจจะต้องดูแลตาน้องเป็นพิเศษ เพราะน้ำตาจะไหลค่อนข้างมาก'
      },
      {
        ProductID: 8,
        ProductName: 'เปอร์เซีย (Persian)',
        pic: './assets/icon/Persian.jpg',
        docDetail: 'เรียกได้ว่าเป็นสายพันธุ์แมวที่คนส่วนใหญ่คุ้นเคยมากที่สุด เป็นแมวที่ขนสลวยสวยเก๋ มีสง่าราศี ดูเป็นแมวลูกคุณ โลกส่วนตัวสูง นิ่งเงียบเรียบร้อย รักสันโดษมาก ๆ และน้องยังมีไหวพริบดีอีกด้วย ตะปบเก่งเชียวล่ะ'
      },
      {
        ProductName: 'เมนคูน (Maine Coon)',
        pic: './assets/icon/Maine.jpg',
        docDetail: 'เมนคูนเป็นสายพันธุ์แมวที่ใหญ่ที่สุด ตัวยาวเกือบเท่าสุนัขเลยก็ว่าได้ ขนยาวเหมือนนางพญาแมว มองเผิน ๆ ดูน่าเกรงขาม แต่จริง ๆ แล้วน้องขี้อ้อนมาก ใจดี และยังชอบอยู่กับคนด้วย ไม่ค่อยกลัวคนแปลกหน้าเท่าไร ใครอยากกอดแมวแทนหมอนข้างแนะนำพันธุ์นี้เลย ก่ายได้พอดี'
      },
      {
        ProductName: 'แร็กดอลล์ (Ragdoll)',
        pic: './assets/icon/Ragdoll.jpg',
        docDetail: 'บรมสวยก็แมวสายพันธุ์แร็กดอลล์นี่แหละ หน้าหวานมาก ขี้อ้อนเป็นที่หนึ่ง แถมนิสัยยังเรียบร้อย ใจเย็น ปรับตัวเข้ากับสภาพแวดล้อมได้ดี ใครหากำลังหาแมวมาเลี้ยงในคอนโดหรืออพาร์ตเมนต์พันธุ์นี้เหมาะเลย น้องชอบมารอที่ประตูด้วยนะ แบบนี้จะไม่หลงได้ไง'
      },
    ];
    this.displayProducts = this.products;
  }

  searchItem(event) {
    const searchText = event.target.value.toLowerCase();
    this.displayProducts = this.products.filter(item => {
      return item.ProductName.toLowerCase().indexOf(searchText.toLowerCase()) > -1;
    });
  }

  goToDetail(name, detail, pic) {
    this.navCtrl.navigateForward(['/detail', {
      pic: pic,
      ProductName: name,
      docDetail: detail
    }]);
  }
}